---
kind: type
id: T:Autodesk.Revit.DB.ReferenceType
source: html/4cfd4e12-3613-c707-ed04-cd61bc7df347.htm
---
# Autodesk.Revit.DB.ReferenceType

Reference types of curve element.

## Syntax (C#)
```csharp
public enum ReferenceType
```